lfe-gen-server.org
#+TITLE: Lfe Flavored Erlang Gen Server
#+OPTIONS: ^:nil num:nil
#+OPTIONS: toc:nil
#+OPTIONS: date:nil
#+OPTIONS: author:nil date:nil
#+OPTIONS: html-postamble:nil

#+HTML_HEAD: <link rel="stylesheet" href="tufte.css" type="text/css" />
#+HTML_HEAD_EXTRA: <meta http-equiv="Content-Security-Policy"  content="default-src 'self'; img-src https://*; child-src 'none';">

Recently I’ve spent some time learning Lfe Flavored Erlang. So far I'm really enjoying it.  I've done
quite a bit of erlang in my past and this is how I think i could branch out into something a little more
modern.  I did consider Elixir, but it feels too alien to me.

This particular entry talks about my method of using TDD to develop a simple application using a concept
from erlang named [[https://www.erlang.org/doc/man/gen_server.html][gen_server]].

Think of it like a 'program skeleton'.  There are other "x-server" relatives in erlang, but gen_server is the
mac daddy of them all.

