lfe-gen-server.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2025-10-07 Tue 16:12 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Lfe Flavored Erlang Gen Server</title>
<meta name="generator" content="Org Mode" />
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1.0, user-scalable=yes">
<meta http-equiv="Content-Security-Policy" content="style-src-elem 'self' https://wmealing.github.io;">
<link rel="stylesheet" href="index.css">
<meta name="author" content="Wade Mealing" />
<meta name="description" content="Lisp Flavored Erlang - A gen server story" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">Lfe Flavored Erlang Gen Server</h1>
<p>
Recently I’ve spent some time learning Lfe Flavored Erlang. So far I'm really enjoying it.  I've done
quite a bit of erlang in my past and this is how I think i could branch out into something a little more
modern.  I did consider Elixir, but it feels too alien to me.
</p>

<p>
This particular entry talks about my method of using TDD to develop a simple application using a concept
from erlang named <a href="https://www.erlang.org/doc/man/gen_server.html">gen_server</a>.
</p>

<p>
Think of it like a 'program skeleton'.  There are other "x-server" relatives in erlang, but gen_server is the
mac daddy of them all.
</p>
