lfe-gen-server.org
**  What is a gen server ?

A "Generic Server" is a long running process within the BEAM virtual machine that expects the developer to create callbacks to fill in specific behavior.

Erlang heavily uses processes, they are super cheap so why not.  Using the gen_server behavior creates a predictable implementation
that other erlang, elixir or lfe programmers would know and expect how to use.  It also fits nicely into the ability for the BEAM vm to supervise gen_servers and
restart them when they crash.  This allows us to bring the erlang "Let it crash" mentality to a lfe, and I think that is pretty neat.

As the LFE lies heavily on the erlang and BEAM, I'll be referncing the erlang docs as I go.

Lets start off our test driven adventure by making a new project, lets call it the pseudobank.

This assumes you have rebar3 installed and ready to rock.

#+begin_src sh
$ rebar3 new lfe-app name="pseudobank"
===> Writing pseudobank/README.md
===> Writing pseudobank/LICENSE
===> Writing pseudobank/rebar.config
===> Writing pseudobank/.gitignore
===> Writing pseudobank/src/pseudobank.lfe
===> Writing pseudobank/src/pseudobank-app.lfe
===> Writing pseudobank/src/pseudobank-sup.lfe
===> Writing pseudobank/src/pseudobank.app.src
#+end_src

The rebar.config file has a problem, it wont build because software is complex, you should change
your deps to use lfe 2.0.1 and plugins to use rebar3_lfe 0.4.0.  This may be fixed by the time
that you read this, you can find the bugreport [[https://github.com/lfe/rebar3_lfe/issues/72][here]].

#+begin_example
{deps, [
    {lfe, "2.0.1"},
    {ltest, "0.13.0"}
]}.

{plugins, [
    {rebar3_lfe, "0.4.0"}
]}.

#+end_example

This created a pretty standard "app" for lfe, with a default structure. The
keen eye may notice the "sup" (standing for supervisor) and we'll get to that later.

One thing it doesn't have is any testing!  The "lfe-app" template is wired up for tests
but doesn't have the directory or templates to work from so, lets make that now.

#+begin_src sh
$ mkdir pseudobank/test/
#+end_src

Inside this directory lets start our test driven development by making a file containing
a test that we know will fail.

Using your editor create a file =pseudobank/tests/pseudobank-tests.lfe=

#+begin_src lisp
  (defmodule pseudobank-tests
     (behaviour ltest-unit))

  (include-lib "ltest/include/ltest-macros.lfe")

  ;;; -----------
  ;;; library API
  ;;; -----------
  (deftest account-server-starts
      (let (((tuple 'ok pid) (account:start)))
        (is (is_pid pid)))
    )

#+end_src

This test "starts" the gen_server (we're going to make one called account).  Like normal 'programs'
that run on the computer, the gen_server has a 'process' id that is returned when the start function
is calle.d  We're pattern matching the return value and checking that the return value is a pid
with the "is_pid".

The "is" function above is part of the ltest macros.n

We can now run the test, its going to fail because we haven't written the 'account' gen server
but lets start.

From the shell within the 'pseudobank' directory:

#+begin_src sh
$ rebar3 lfe ltest
    ===> Verifying dependencies...
    ===> Compiling pseudobank
    ================================ ltest =================================

    ------------------------------ Unit Tests ------------------------------

    module: pseudobank-tests
      module 'pseudobank-tests' ....................................... [fail]

          Assertion failure:
          undef

      time: 14ms

    summary:
      Tests: 1  Passed: 0  Skipped: 0  Failed: 1 Erred: 0
      Total time: 14ms


    ========================================================================
#+end_src

Your version will likely be much more colorful, I'm sure you can use your imagination. More specific
tests can be run, but you can check out how to do that with the command "rebar3 help lfe ltest"

Lets fix that.. we'll make the account gen server first.

Lets make one in =src/account.lfe=


#+begin_src lisp
  (defmodule account
                  (behaviour gen_server)
                  (export all))

  ;;; helper functions
  (defun server-name () (MODULE))
  (defun register-name () `#(local ,(server-name)))
  (defun callback-module () (MODULE))
  (defun initial-state () 0)
  (defun genserver-opts () '())

  ;;; gen_server implementation

  (defun start ()
    (gen_server:start (register-name)
                      (callback-module)
                      (initial-state)
                      (genserver-opts)))
#+end_src

Now we have the start function, this looks like quite a lot of noise but this is the skeleton
startup code used for any gen_server.

Now when you run the test, we can see the test fails.

#+begin_example sh
module: pseudobank-tests
  module 'pseudobank-tests' ....................................... [fail]

      Assertion failure:
=CRASH REPORT==== 22-Oct-2022::02:48:36.950759 ===
  crasher:
    initial call: account:init/1
    pid: <0.400.0>
    registered_name: []
    exception error: undefined function account:init/1
      in function  gen_server:init_it/2 (gen_server.erl, line 423)
      in call from gen_server:init_it/6 (gen_server.erl, line 390)

      <snip>
#+end_example

We have a backtrace, which shows the path of the callback from gen_server initialization. Its crashing
in "account:init" which is not surprisingly really, we are missing the account:init function,

This is one of thoe callbacks that gen_server expects. Fortunately the gen_server page outlines the callbacks
expected, however not all are required.

Lets add the init callback by appending the following to the =account.lfe=

#+begin_src lisp
  (defun init (initial-state)
    `#(ok ,initial-state))
#+end_src

This function initiates the initial internal state that the gen_server keeps with itself until it dies or restarts.

This function can return #(ok anything) as long as its 'ok' the gen_server doesn't care what we have done, it could hold state for any reason.
If it returns #(error anything), thats a good sign that the initialization procedure didnt work correctly.

Now when we run the test again:

#+begin_example sh
module: pseudobank-tests
  module 'pseudobank-tests' ......................................... [ok]
#+end_example

We can see the test passes.

