lfe-gen-server.html
<div id="outline-container-org544289c" class="outline-3">
<h3 id="org544289c">What is a gen server ?</h3>
<div class="outline-text-3" id="text-org544289c">
<p>
A "Generic Server" is a long running process within the BEAM virtual machine that expects the developer to create callbacks to fill in specific behavior.
</p>

<p>
Erlang heavily uses processes, they are super cheap so why not.  Using the gen_server behavior creates a predictable implementation
that other erlang, elixir or lfe programmers would know and expect how to use.  It also fits nicely into the ability for the BEAM vm to supervise gen_servers and
restart them when they crash.  This allows us to bring the erlang "Let it crash" mentality to a lfe, and I think that is pretty neat.
</p>

<p>
As the LFE lies heavily on the erlang and BEAM, I'll be referncing the erlang docs as I go.
</p>

<p>
Lets start off our test driven adventure by making a new project, lets call it the pseudobank.
</p>

<p>
This assumes you have rebar3 installed and ready to rock.
</p>

<div class="org-src-container">
<pre class="src src-sh">$ rebar3 new lfe-app <span style="font-weight: bold; font-style: italic;">name</span>=<span style="font-style: italic;">"pseudobank"</span>
===&gt; Writing pseudobank/README.md
===&gt; Writing pseudobank/LICENSE
===&gt; Writing pseudobank/rebar.config
===&gt; Writing pseudobank/.gitignore
===&gt; Writing pseudobank/src/pseudobank.lfe
===&gt; Writing pseudobank/src/pseudobank-app.lfe
===&gt; Writing pseudobank/src/pseudobank-sup.lfe
===&gt; Writing pseudobank/src/pseudobank.app.src
</pre>
</div>

<p>
The rebar.config file has a problem, it wont build because software is complex, you should change
your deps to use lfe 2.0.1 and plugins to use rebar3_lfe 0.4.0.  This may be fixed by the time
that you read this, you can find the bugreport <a href="https://github.com/lfe/rebar3_lfe/issues/72">here</a>.
</p>

<pre class="example" id="org19e462a">
{deps, [
    {lfe, "2.0.1"},
    {ltest, "0.13.0"}
]}.

{plugins, [
    {rebar3_lfe, "0.4.0"}
]}.

</pre>

<p>
This created a pretty standard "app" for lfe, with a default structure. The
keen eye may notice the "sup" (standing for supervisor) and we'll get to that later.
</p>

<p>
One thing it doesn't have is any testing!  The "lfe-app" template is wired up for tests
but doesn't have the directory or templates to work from so, lets make that now.
</p>

<div class="org-src-container">
<pre class="src src-sh">$ mkdir pseudobank/test/
</pre>
</div>

<p>
Inside this directory lets start our test driven development by making a file containing
a test that we know will fail.
</p>

<p>
Using your editor create a file <code>pseudobank/tests/pseudobank-tests.lfe</code>
</p>

<div class="org-src-container">
<pre class="src src-lisp">(defmodule pseudobank-tests
   (behaviour ltest-unit))

(include-lib <span style="font-style: italic;">"ltest/include/ltest-macros.lfe"</span>)

<span style="font-weight: bold; font-style: italic;">;;; </span><span style="font-weight: bold; font-style: italic;">-----------
</span><span style="font-weight: bold; font-style: italic;">;;; </span><span style="font-weight: bold; font-style: italic;">library API
</span><span style="font-weight: bold; font-style: italic;">;;; </span><span style="font-weight: bold; font-style: italic;">-----------
</span>(deftest account-server-starts
    (<span style="font-weight: bold;">let</span> (((tuple 'ok pid) (account:start)))
      (is (is_pid pid))))
</pre>
</div>

<p>
This test "starts" the gen_server (we're going to make one called account).  Like normal 'programs'
that run on the computer, the gen_server has a 'process' id that is returned when the start function
is calle.d  We're pattern matching the return value and checking that the return value is a pid
with the "is_pid".
</p>

<p>
The "is" function above is part of the ltest macros.n
</p>

<p>
We can now run the test, its going to fail because we haven't written the 'account' gen server
but lets start.
</p>

<p>
From the shell within the 'pseudobank' directory:
</p>

<div class="org-src-container">
<pre class="src src-sh">$ rebar3 lfe ltest
    ===&gt; Verifying dependencies...
    ===&gt; Compiling pseudobank
    ================================ <span style="font-weight: bold; font-style: italic;">ltest</span> =================================

    ------------------------------ Unit Tests ------------------------------

    module: pseudobank-tests
      module <span style="font-style: italic;">'pseudobank-tests'</span> ....................................... [fail]

          Assertion failure:
          undef

      <span style="font-weight: bold;">time</span>: 14ms

    summary:
      Tests: 1  Passed: 0  Skipped: 0  Failed: 1 Erred: 0
      Total time: 14ms


    ========================================================================
</pre>
</div>

<p>
Your version will likely be much more colorful, I'm sure you can use your imagination. More specific
tests can be run, but you can check out how to do that with the command "rebar3 help lfe ltest"
</p>

<p>
Lets fix that.. we'll make the account gen server first.
</p>

<p>
Lets make one in <code>src/account.lfe</code>
</p>


<div class="org-src-container">
<pre class="src src-lisp">(defmodule account
                (behaviour gen_server)
                (export all))

<span style="font-weight: bold; font-style: italic;">;;; </span><span style="font-weight: bold; font-style: italic;">helper functions
</span>(<span style="font-weight: bold;">defun</span> <span style="font-weight: bold;">server-name</span> () (MODULE))
(<span style="font-weight: bold;">defun</span> <span style="font-weight: bold;">register-name</span> () `#(local ,(server-name)))
(<span style="font-weight: bold;">defun</span> <span style="font-weight: bold;">callback-module</span> () (MODULE))
(<span style="font-weight: bold;">defun</span> <span style="font-weight: bold;">initial-state</span> () 0)
(<span style="font-weight: bold;">defun</span> <span style="font-weight: bold;">genserver-opts</span> () '())

<span style="font-weight: bold; font-style: italic;">;;; </span><span style="font-weight: bold; font-style: italic;">gen_server implementation
</span>
(<span style="font-weight: bold;">defun</span> <span style="font-weight: bold;">start</span> ()
  (gen_server:start (register-name)
                    (callback-module)
                    (initial-state)
                    (genserver-opts)))
</pre>
</div>

<p>
Now we have the start function, this looks like quite a lot of noise but this is the skeleton
startup code used for any gen_server.
</p>

<p>
Now when you run the test, we can see the test fails.
</p>

<pre class="example" id="org76263e1">
module: pseudobank-tests
  module 'pseudobank-tests' ....................................... [fail]

      Assertion failure:
=CRASH REPORT==== 22-Oct-2022::02:48:36.950759 ===
  crasher:
    initial call: account:init/1
    pid: &lt;0.400.0&gt;
    registered_name: []
    exception error: undefined function account:init/1
      in function  gen_server:init_it/2 (gen_server.erl, line 423)
      in call from gen_server:init_it/6 (gen_server.erl, line 390)

      &lt;snip&gt;
</pre>

<p>
We have a backtrace, which shows the path of the callback from gen_server initialization. Its crashing
in "account:init" which is not surprisingly really, we are missing the account:init function,
</p>

<p>
This is one of thoe callbacks that gen_server expects. Fortunately the gen_server page outlines the callbacks
expected, however not all are required.
</p>

<p>
Lets add the init callback by appending the following to the <code>account.lfe</code>
</p>

<div class="org-src-container">
<pre class="src src-lisp">(<span style="font-weight: bold;">defun</span> <span style="font-weight: bold;">init</span> (initial-state)
  `#(ok ,initial-state))
</pre>
</div>

<p>
This function initiates the initial internal state that the gen_server keeps with itself until it dies or restarts.
</p>

<p>
This function can return #(ok anything) as long as its 'ok' the gen_server doesn't care what we have done, it could hold state for any reason.
If it returns #(error anything), thats a good sign that the initialization procedure didnt work correctly.
</p>

<p>
Now when we run the test again:
</p>

<pre class="example" id="org206d3d4">
module: pseudobank-tests
  module 'pseudobank-tests' ......................................... [ok]
</pre>

<p>
We can see the test passes.
</p>
</div>
</div>
