lfe-gen-server.org
** Getting the balance

Now, lets talk about money.  Lets check to see if it starts with zero balance.

Start by writing the test, I add a new test in the =pseudobank-test.lfe= file.

#+begin_src lisp
  (deftest account-server-starts-with-zero-balance
    (account:start)
    (is-equal 0.00 (account:get-balance)))
#+end_src

When running the test, you'll see it returns 'undef' again.

#+begin_src sh
  account_server_starts_with_zero_balance ......................... [fail]

  Assertion failure:
    undef
#+end_src

This is of course, because get-balance function doesn't exist.  The simple
solution is to start, making a get-balance function in the file.  Lets do that.

I usually try to do the simplest possible thing to get a test passing.  So i'm going
to make a function that returns a hard-coded 0.  This wont be using all the 'gen_server'
goodies, but its something to work from.

#+begin_src lisp
  (defun get-balance ()
      0)
#+end_src

Lets use the gen_servers "state" to store the balance, so as long as the "account" process
is running we can access the current account value.

We'll modfy 'init' to return a map.  In LFE the map is represented as #M( key value ... ...),
Below is the modified init, to use a monetary value for the amount in the account.

#+begin_src lisp
  (defun init (initial-state)
    `#(ok ,#M(balance 0.00)))
#+end_src

Now we modify the get-balance/0 function to call the =gen_server:call/3= function.
The first argument is the process ID, the second parameter is passed to the =handle_call/3= callback that
gen_server expects the user to provide.

The gen_server:call function is synchronous, so your application will wait around for however long the work done takes.

Lets fix up get-balance as we talked about earlier:

#+begin_src lisp
(defun get-balance ()
  (gen_server:call (server-name) 'get-balance))
#+end_src

This uses the (server-name) helper function to look up the 'gen_server' by its name.

The gen_server will relay the call function back to handle_call function which we will implement now.

Lets run the test to check our expectations.

We can see the =CRASH REPORT= in the =undefined function account:handle_call/3=
when the code is looking for handle_call, which we have not created.

#+begin_example
  =CRASH REPORT==== 22-Oct-2022::03:37:19.059020 ===
  crasher:
    initial call: account:init/1
    pid: <0.536.0>
    registered_name: account
    exception error: undefined function account:handle_call/3
      in function  gen_server:try_handle_call/4 (gen_server.erl, line 721)
      in call from gen_server:handle_msg/6 (gen_server.erl, line 750)
#+end_example

Lets make that now, the simplest possible implementation

#+begin_src lisp 
 (handle_call
  ((_message _caller state)
   `#(reply 0.00 ,state)))
#+end_src


For those who dont write much lisp or erlang, you can specify a pattern matching operation
on the functions heads, its a pretty neat feature but will be surprising if you dont remember/know about it.
The LFE tutorial talks about it [[https://lfe.gitbooks.io/tutorial/content/sequential/conds.html#function-heads-as-conditionals][here]].


Words that start with an underscore, means 'we dont care about it' so in this case we're accepting
-every- message and not matching on the first term.  This wont be the case later but it works for now.

Now when we run the tests, we can see what it is returning.

#+begin_example
  account_server_starts_with_zero_balance ......................... [fail]

      Assertion failure:
      #(assertEqual
               (#(module pseudobank-tests)
                #(line 15)
                #(expression "(account:get-balance)")
                #(expected 0)
                #(value 'message-goes-here)))
#+end_example

We can see its returning the "message-goes-here" from the callback instead of the zero.  Lets return
the current balance (0.00) now.

#+begin_src lisp
  (defun handle_call
  ((_message  _caller state)
   `#(reply ,(map-get state 'balance),state)))
#+end_src

At this point it still ignores the message and the caller, but it returns the balance
that was set created/set during the init function.

The change is to the second return arguement,  we use =(map-get <mapname> <key> )= to get the value,
we know the key is an atom called 'balance so this would transform into after all values are evaluated.

#+begin_src lisp
  #(reply 0 #M(balance 0.00))
#+end_src

Cool, so now we have a basic "get the current balance" =gen_server= working, lets add a new
test to deposit money into the account.

