lfe-gen-server.html
<div id="outline-container-orge4ff1d2" class="outline-3">
<h3 id="orge4ff1d2">Getting the balance</h3>
<div class="outline-text-3" id="text-orge4ff1d2">
<p>
Now, lets talk about money.  Lets check to see if it starts with zero balance.
</p>

<p>
Start by writing the test, I add a new test in the <code>pseudobank-test.lfe</code> file.
</p>

<div class="org-src-container">
<pre class="src src-lisp">(deftest account-server-starts-with-zero-balance
  (account:start)
  (is-equal 0.00 (account:get-balance)))
</pre>
</div>

<p>
When running the test, you'll see it returns 'undef' again.
</p>

<div class="org-src-container">
<pre class="src src-sh">account_server_starts_with_zero_balance ......................... [fail]

Assertion failure:
  undef
</pre>
</div>

<p>
This is of course, because get-balance function doesn't exist.  The simple
solution is to start, making a get-balance function in the file.  Lets do that.
</p>

<p>
I usually try to do the simplest possible thing to get a test passing.  So i'm going
to make a function that returns a hard-coded 0.  This wont be using all the 'gen_server'
goodies, but its something to work from.
</p>

<div class="org-src-container">
<pre class="src src-lisp">(<span style="font-weight: bold;">defun</span> <span style="font-weight: bold;">get-balance</span> ()
  0)
</pre>
</div>

<p>
Lets use the gen_servers "state" to store the balance, so as long as the "account" process
is running we can access the current account value.
</p>

<p>
We'll modfy 'init' to return a map.  In LFE the map is represented as #M( key value &#x2026; &#x2026;),
Below is the modified init, to use a monetary value for the amount in the account.
</p>

<div class="org-src-container">
<pre class="src src-lisp">(<span style="font-weight: bold;">defun</span> <span style="font-weight: bold;">init</span> (initial-state)
  `#(ok ,#M(balance 0.00)))
</pre>
</div>

<p>
Now we modify the get-balance/0 function to call the <code>gen_server:call/3</code> function.
The first argument is the process ID, the second parameter is passed to the <code>handle_call/3</code> callback that
gen_server expects the user to provide.
</p>

<p>
The gen_server:call function is synchronous, so your application will wait around for however long the work done takes.
</p>

<p>
Lets fix up get-balance as we talked about earlier:
</p>

<div class="org-src-container">
<pre class="src src-lisp">(<span style="font-weight: bold;">defun</span> <span style="font-weight: bold;">get-balance</span> ()
  (gen_server:call (server-name) 'get-balance))
</pre>
</div>

<p>
This uses the (server-name) helper function to look up the 'gen_server' by its name.
</p>

<p>
The gen_server will relay the call function back to handle_call function which we will implement now.
</p>

<p>
Lets run the test to check our expectations.
</p>

<p>
We can see the <code>CRASH REPORT</code> in the <code>undefined function account:handle_call/3</code>
when the code is looking for handle_call, which we have not created.
</p>

<pre class="example" id="org92c9983">
=CRASH REPORT==== 22-Oct-2022::03:37:19.059020 ===
crasher:
  initial call: account:init/1
  pid: &lt;0.536.0&gt;
  registered_name: account
  exception error: undefined function account:handle_call/3
    in function  gen_server:try_handle_call/4 (gen_server.erl, line 721)
    in call from gen_server:handle_msg/6 (gen_server.erl, line 750)
</pre>

<p>
Lets make that now, the simplest possible implementation
</p>

<div class="org-src-container">
<pre class="src src-lisp">(handle_call
 ((_message _caller state)
  `#(reply 0.00 ,state)))
</pre>
</div>


<p>
For those who dont write much lisp or erlang, you can specify a pattern matching operation
on the functions heads, its a pretty neat feature but will be surprising if you dont remember/know about it.
The LFE tutorial talks about it <a href="https://lfe.gitbooks.io/tutorial/content/sequential/conds.html#function-heads-as-conditionals">here</a>.
</p>


<p>
Words that start with an underscore, means 'we dont care about it' so in this case we're accepting
-every- message and not matching on the first term.  This wont be the case later but it works for now.
</p>

<p>
Now when we run the tests, we can see what it is returning.
</p>

<pre class="example" id="org0f41ec2">
account_server_starts_with_zero_balance ......................... [fail]

    Assertion failure:
    #(assertEqual
             (#(module pseudobank-tests)
              #(line 15)
              #(expression "(account:get-balance)")
              #(expected 0)
              #(value 'message-goes-here)))
</pre>

<p>
We can see its returning the "message-goes-here" from the callback instead of the zero.  Lets return
the current balance (0.00) now.
</p>

<div class="org-src-container">
<pre class="src src-lisp">(<span style="font-weight: bold;">defun</span> <span style="font-weight: bold;">handle_call</span>
((_message  _caller state)
 `#(reply ,(map-get state 'balance),state)))
</pre>
</div>

<p>
At this point it still ignores the message and the caller, but it returns the balance
that was set created/set during the init function.
</p>

<p>
The change is to the second return arguement,  we use <code>(map-get &lt;mapname&gt; &lt;key&gt; )</code> to get the value,
we know the key is an atom called 'balance so this would transform into after all values are evaluated.
</p>

<div class="org-src-container">
<pre class="src src-lisp">#(reply 0 #M(balance 0.00))
</pre>
</div>

<p>
Cool, so now we have a basic "get the current balance" <code>gen_server</code> working, lets add a new
test to deposit money into the account.
</p>
</div>
</div>
