lfe-gen-server.org
** Making a deposit.

Back in =pseudobank-test.lfe= to add a new failing test for depositing money.

#+begin_src lisp
  (deftest account-server-deposit-works
    (account:start)
    (let ((starting-balance (account:get-balance))
          (deposit-amount 1.23))
      (account:deposit deposit-amount)
      (is-equal (+ starting-balance deposit-amount) (account:get-balance))))
#+end_src

This test is a little more involved, it starts the account process (its probably already started by another test),
then sets two values, 'starting-balance' to the accounts current-balance and 'deposit-amount' is an arbitrary amount. value was chosen, just because it looks fun.

When we run this module tests, ltest cant find the account:deposit function, lets make it.

This is the 'helper' function which can be called, which in turn calls gen-server with the two parameters.

#+begin_src lisp
(defun deposit (amount)
  (gen_server:call (server-name) ('deposit amount)))
#+end_src

Like the =get-balance= function, it will also be sent to the =handle_call/3= callback function, however it
passes a tuple of the 'deposit atom and an amount instead of just an atom.

Lets fix up =handle_call/3= to match this new callback request.

#+begin_src lisp
  (defun handle_call
  (('get-balance _caller state)
   `#(reply ,(map-get state 'balance) ,state))
  (((tuple 'deposit amount) _caller state)
   `#(reply 'ok, ,(map-update state 'balance 1.23))))
#+end_src

The changes are: ='get-balance= in the first match, as we have multiple entries into the handle_call
we now need to get more specific and have the ='get-balance= specifically handle only the calls from
the 'get-balance helper, otherwise it will match for when we try to do a deposit.

We added the 'second' match clause for handle_call when it the first parameter is (tuple 'deposit some-amount).

The return value from this match is the same format, we're not going to tell the caller the new balance, but
we need to update the state in the most naive method.  Lets check the test run output:

#+begin_example
module: pseudobank-tests
  account_server_starts ............................................. [ok]
  account_server_starts_with_zero_balance ........................... [ok]
  account_server_deposit_works ...................................... [ok]
#+end_example

The =handle_call/3= callback is only returning a hard coded value, and what is
required is to to find the current value, add the deposit value and update the proccesses
internal state with the newly computed value.

Back to the =account.lfe= file, to fix this oversight:

#+begin_src lisp
(defun handle_call
  (('get-balance _caller state)
   `#(reply ,(map-get state 'balance) ,state))
  (((tuple 'deposit amount) _caller state)
   `#(reply 'ok
            ,(map-update state 'balance
                         (+ (map-get state 'balance) amount)))))
#+end_src

The difference is now that it checks the previous value, adds the requested amount to the previous vale
and updates the process state by returning all this in the third element of the tuple from the function =handle_call=.

I'd say we had desposits nailed.

** Making a withdrawal

The withdrawal is removing money from your bank account.  Like the bank accounts of old, there will need to be
logic to ensure that your account doesn't go into the negative (The bank wouldnt want any of their fictional
money to go to YOU!)  Lets start by writing a test to ensure we can take money from the account.

#+begin_src lisp
    (deftest account-server-withdrawal-works
    (account:start)
    (let ((starting-balance (account:get-balance))
          (deposit-amount 10.00)
          (withdraw-amount 1.00))
      (account:deposit deposit-amount)
      (account:withdraw withdraw-amount)
      (is-equal (- deposit-amount withdraw-amount) (account:get-balance))))
#+end_src

This is a little more complex, we deposit 10.00 and then take away 1.00.  This should
lead to having 9.00 in the account.  When we run this test , it once again returns 'undef'
because the withdraw function is not implemented.  Hop to it then.

Back in =account.lfe=, we'll make the helper function.

#+begin_src lisp
(defun withdraw ( amount )
  (gen_server:call (server-name) (tuple 'withdraw amount)))
#+end_src

The callback doesn't handle the (tuple 'withdraw amount), make it happen.

#+begin_src lisp
  (defun handle_call

    ;; get balance functionality
    (('get-balance _caller state)
     `#(reply ,(map-get state 'balance) ,state))

    ;; deposit functionality
    (((tuple 'deposit amount) _caller state)
     `#(reply 'ok
              ,(map-update state 'balance
                           (+ (map-get state 'balance) amount))))

    ;; withdraw money functionality.
    (((tuple 'withdraw amount) _caller state)
     `#(reply 'ok
              ,(map-update state 'balance
                           (- (map-get state 'balance) amount)))))
#+end_src

The withdraw callback isnt feature complete, its pretty much a basic modification of 'deposit feature.
It doesn't do any validation of values.

And now the test..

#+begin_src lisp

  account_server_withdrawal_works ................................. [fail]

    Assertion failure:
    #(assertEqual
             (#(module pseudobank-tests)
              #(line 26)
              #(expression "(account:get-balance)")
              #(expected 9.0)
              #(value 10.23)))
#+end_src

Ok, thats weird.  It looks like the value of 10.23 is 1.00 dollar less than the final state
from the last test.  We're going to have to implement some kind of shutdown mechanism which
we can run after the test finishes to reset the state.

