lfe-gen-server.html
<div id="outline-container-org1e9daf9" class="outline-3">
<h3 id="org1e9daf9">Making a deposit.</h3>
<div class="outline-text-3" id="text-org1e9daf9">
<p>
Back in <code>pseudobank-test.lfe</code> to add a new failing test for depositing money.
</p>

<div class="org-src-container">
<pre class="src src-lisp">(deftest account-server-deposit-works
  (account:start)
  (<span style="font-weight: bold;">let</span> ((starting-balance (account:get-balance))
        (deposit-amount 1.23))
    (account:deposit deposit-amount)
    (is-equal (+ starting-balance deposit-amount) (account:get-balance))))
</pre>
</div>

<p>
This test is a little more involved, it starts the account process (its probably already started by another test),
then sets two values, 'starting-balance' to the accounts current-balance and 'deposit-amount' is an arbitrary amount. value was chosen, just because it looks fun.
</p>

<p>
When we run this module tests, ltest cant find the account:deposit function, lets make it.
</p>

<p>
This is the 'helper' function which can be called, which in turn calls gen-server with the two parameters.
</p>

<div class="org-src-container">
<pre class="src src-lisp">(<span style="font-weight: bold;">defun</span> <span style="font-weight: bold;">deposit</span> (amount)
  (gen_server:call (server-name) ('deposit amount)))
</pre>
</div>

<p>
Like the <code>get-balance</code> function, it will also be sent to the <code>handle_call/3</code> callback function, however it
passes a tuple of the 'deposit atom and an amount instead of just an atom.
</p>

<p>
Lets fix up <code>handle_call/3</code> to match this new callback request.
</p>

<div class="org-src-container">
<pre class="src src-lisp">(<span style="font-weight: bold;">defun</span> <span style="font-weight: bold;">handle_call</span>
(('get-balance _caller state)
 `#(reply ,(map-get state 'balance) ,state))
(((tuple 'deposit amount) _caller state)
 `#(reply 'ok, ,(map-update state 'balance 1.23))))
</pre>
</div>

<p>
The changes are: <code>'get-balance</code> in the first match, as we have multiple entries into the handle_call
we now need to get more specific and have the <code>'get-balance</code> specifically handle only the calls from
the 'get-balance helper, otherwise it will match for when we try to do a deposit.
</p>

<p>
We added the 'second' match clause for handle_call when it the first parameter is (tuple 'deposit some-amount).
</p>

<p>
The return value from this match is the same format, we're not going to tell the caller the new balance, but
we need to update the state in the most naive method.  Lets check the test run output:
</p>

<pre class="example" id="orgda88ff8">
module: pseudobank-tests
  account_server_starts ............................................. [ok]
  account_server_starts_with_zero_balance ........................... [ok]
  account_server_deposit_works ...................................... [ok]
</pre>

<p>
The <code>handle_call/3</code> callback is only returning a hard coded value, and what is
required is to to find the current value, add the deposit value and update the proccesses
internal state with the newly computed value.
</p>

<p>
Back to the <code>account.lfe</code> file, to fix this oversight:
</p>

<div class="org-src-container">
<pre class="src src-lisp">(<span style="font-weight: bold;">defun</span> <span style="font-weight: bold;">handle_call</span>
  (('get-balance _caller state)
   `#(reply ,(map-get state 'balance) ,state))
  (((tuple 'deposit amount) _caller state)
   `#(reply 'ok
            ,(map-update state 'balance
                         (+ (map-get state 'balance) amount)))))
</pre>
</div>

<p>
The difference is now that it checks the previous value, adds the requested amount to the previous vale
and updates the process state by returning all this in the third element of the tuple from the function <code>handle_call</code>.
</p>

<p>
I'd say we had desposits nailed.
</p>
</div>
</div>
<div id="outline-container-org83b8e32" class="outline-3">
<h3 id="org83b8e32">Making a withdrawal</h3>
<div class="outline-text-3" id="text-org83b8e32">
<p>
The withdrawal is removing money from your bank account.  Like the bank accounts of old, there will need to be
logic to ensure that your account doesn't go into the negative (The bank wouldnt want any of their fictional
money to go to YOU!)  Lets start by writing a test to ensure we can take money from the account.
</p>

<div class="org-src-container">
<pre class="src src-lisp">(deftest account-server-withdrawal-works
(account:start)
(<span style="font-weight: bold;">let</span> ((starting-balance (account:get-balance))
      (deposit-amount 10.00)
      (withdraw-amount 1.00))
  (account:deposit deposit-amount)
  (account:withdraw withdraw-amount)
  (is-equal (- deposit-amount withdraw-amount) (account:get-balance))))
</pre>
</div>

<p>
This is a little more complex, we deposit 10.00 and then take away 1.00.  This should
lead to having 9.00 in the account.  When we run this test , it once again returns 'undef'
because the withdraw function is not implemented.  Hop to it then.
</p>

<p>
Back in <code>account.lfe</code>, we'll make the helper function.
</p>

<div class="org-src-container">
<pre class="src src-lisp">(<span style="font-weight: bold;">defun</span> <span style="font-weight: bold;">withdraw</span> ( amount )
  (gen_server:call (server-name) (tuple 'withdraw amount)))
</pre>
</div>

<p>
The callback doesn't handle the (tuple 'withdraw amount), make it happen.
</p>

<div class="org-src-container">
<pre class="src src-lisp">(<span style="font-weight: bold;">defun</span> <span style="font-weight: bold;">handle_call</span>

  <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">get balance functionality
</span>  (('get-balance _caller state)
   `#(reply ,(map-get state 'balance) ,state))

  <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">deposit functionality
</span>  (((tuple 'deposit amount) _caller state)
   `#(reply 'ok
            ,(map-update state 'balance
                         (+ (map-get state 'balance) amount))))

  <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">withdraw money functionality.
</span>  (((tuple 'withdraw amount) _caller state)
   `#(reply 'ok
            ,(map-update state 'balance
                         (- (map-get state 'balance) amount)))))
</pre>
</div>

<p>
The withdraw callback isnt feature complete, its pretty much a basic modification of 'deposit feature.
It doesn't do any validation of values.
</p>

<p>
And now the test..
</p>

<div class="org-src-container">
<pre class="src src-lisp">account_server_withdrawal_works ................................. [fail]

  Assertion failure:
  #(assertEqual
           (#(module pseudobank-tests)
            #(line 26)
            #(expression <span style="font-style: italic;">"(account:get-balance)"</span>)
            #(expected 9.0)
            #(value 10.23)))
</pre>
</div>

<p>
Ok, thats weird.  It looks like the value of 10.23 is 1.00 dollar less than the final state
from the last test.  We're going to have to implement some kind of shutdown mechanism which
we can run after the test finishes to reset the state.
</p>
</div>
</div>
