lfe-gen-server.org
** Withraw Interlude: gen_server shutdown.

As the LFE gen-server piggy backs on the =erlang= implementation of gen_server the
[[https://www.erlang.org/doc/man/gen_server.html][stdlib reference manual]] includes a method to shut down the server.

The manual goes into return values for [[https://www.erlang.org/doc/man/gen_server.html#Module:handle_call-3][handle_call/3]] specifies that the gen_server
can be terminated if handle_call returns the right tuple.

#+begin_example
 {stop,Reason,NewState}
#+end_example

Which would call the (module:terminate Reason NewState) function.

In our example we could just ignore the values sent to the terminate function, but
there may be cases where you could use it, like stuffing it into a database, logging
or firing the state up again after some modification.

Here is the helper function, which triggers handle_call with the argument ='stop=.

#+begin_src lisp
  (defun stop ()
    (gen_server:call (server-name) 'stop))
#+end_src

And now lets add this to handle_call, i'll only include the match part of handle_call, You can check the
[[http://github.com/wmealing/psuedobank/src/account.lfe][file in github]] for the full function, here is the basics.

#+begin_src lisp
 (('stop _caller state-data)
    `#(stop shutdown ok state-data))
#+end_src

And the matching expected terminate function.

#+begin_src lisp
(defun terminate ( _reason _newstate )
    'ok)
#+end_src

Now that the shutdown function is implemented, add a test to see if starting, shutting down
and starting up again works.

Here is our test:

#+begin_src lisp
  (deftest account-server-starts-and-stops
    (let ((stop-val (account:stop))
          (start-val-pid (tref (account:start) 2))
          (stop-again-val (account:stop)))
      (is-equal stop-val 'ok)
      (is-equal (is_pid start-val-pid) 'true)
      (is-equal stop-again-val 'ok)))
#+end_src

Now lets run the test.

#+begin_src sh
module: pseudobank-tests
  account_server_starts ............................................. [ok]
  account_server_starts_with_zero_balance ........................... [ok]
  account_server_deposit_works ...................................... [ok]
  account_server_withdrawal_works ................................... [ok]
  account_server_starts_and_stops ................................... [ok]
#+end_src

Giddy up, now we have the server restarting, but back to the topic at hand getting
withdraw and its rules

** Withdraw resumed:

Lets get back to withdraw, to fix it.. the next thing we need to implement is ensure that
you cant withdraw can not put it the account balance into negative value. Here's the test.

#+begin_src lisp
(deftest account-server-withdraw-negative-test
  (account:start)
    (let* ((starting-balance (account:get-balance))
          (deposit-amount 1.00)
          (withdraw-amount 200.00))
      (account:deposit deposit-amount)
      (is (=:= (account:withdraw withdraw-amount) 'insufficient-funds))))
#+end_src

This test will fail when we run the test because there has been no error condition
returning 'insufficient-funds when the withdraw amount exceeds available balance.

Fixing that now, we're modifying =handle_call= to include a conditional return based
on if the amount is greater than the balance.

#+begin_src lisp
  ;; withdraw
  (((tuple 'withdraw amount) _caller state)

   ;; first step, check that amount is less than the current balance.
   (if (> amount (map-get state 'balance))
     ;; true condition
     `#(reply ,'insufficient-funds ,state)
     ;; false condition
     `#(reply ,'ok ,(map-update state 'balance (- (map-get state 'balance) amount)))
     ))
#+end_src

All tests should now pass.

#+begin_src sh
$ rebar3 as test lfe ltest
===> Verifying dependencies...
===> Compiling pseudobank
================================ ltest =================================

------------------------------ Unit Tests ------------------------------

module: pseudobank-tests
  account_server_starts ............................................. [ok]
  account_server_starts_with_zero_balance ........................... [ok]
  account_server_deposit_works ...................................... [ok]
  account_server_withdrawal_works ................................... [ok]
  account_server_starts_and_stops ................................... [ok]
  account_server_withdraw_negative_test ............................. [ok]
  time: 25ms

summary:
  Tests: 6  Passed: 6  Skipped: 0  Failed: 0 Erred: 0
  Total time: 43ms
#+end_src

This isnt an exhaustive test suite, but its the basics of the gen_server and
test driven development for lfe.  I'll upload the project to github and put a
link right here soon.

* Resources:

- https://www.erlang.org/doc/man/gen_server.html#Module:handle_call-3
- https://www.erlang-factory.com/upload/presentations/523/EFSF2012-Implementinglanguages.pdf
- https://github.com/lfex/ltest

