lfe-gen-server.html
<div id="outline-container-org6a9072f" class="outline-3">
<h3 id="org6a9072f">Withraw Interlude: gen_server shutdown.</h3>
<div class="outline-text-3" id="text-org6a9072f">
<p>
As the LFE gen-server piggy backs on the <code>erlang</code> implementation of gen_server the
<a href="https://www.erlang.org/doc/man/gen_server.html">stdlib reference manual</a> includes a method to shut down the server.
</p>

<p>
The manual goes into return values for <a href="https://www.erlang.org/doc/man/gen_server.html#Module:handle_call-3">handle_call/3</a> specifies that the gen_server
can be terminated if handle_call returns the right tuple.
</p>

<pre class="example" id="org9dbcffc">
{stop,Reason,NewState}
</pre>

<p>
Which would call the (module:terminate Reason NewState) function.
</p>

<p>
In our example we could just ignore the values sent to the terminate function, but
there may be cases where you could use it, like stuffing it into a database, logging
or firing the state up again after some modification.
</p>

<p>
Here is the helper function, which triggers handle_call with the argument <code>'stop</code>.
</p>

<div class="org-src-container">
<pre class="src src-lisp">(<span style="font-weight: bold;">defun</span> <span style="font-weight: bold;">stop</span> ()
  (gen_server:call (server-name) 'stop))
</pre>
</div>

<p>
And now lets add this to handle_call, i'll only include the match part of handle_call, You can check the
<a href="http://github.com/wmealing/psuedobank/src/account.lfe">file in github</a> for the full function, here is the basics.
</p>

<div class="org-src-container">
<pre class="src src-lisp">(('stop _caller state-data)
   `#(stop shutdown ok state-data))
</pre>
</div>

<p>
And the matching expected terminate function.
</p>

<div class="org-src-container">
<pre class="src src-lisp">(<span style="font-weight: bold;">defun</span> <span style="font-weight: bold;">terminate</span> ( _reason _newstate )
    'ok)
</pre>
</div>

<p>
Now that the shutdown function is implemented, add a test to see if starting, shutting down
and starting up again works.
</p>

<p>
Here is our test:
</p>

<div class="org-src-container">
<pre class="src src-lisp">(deftest account-server-starts-and-stops
  (<span style="font-weight: bold;">let</span> ((stop-val (account:stop))
        (start-val-pid (tref (account:start) 2))
        (stop-again-val (account:stop)))
    (is-equal stop-val 'ok)
    (is-equal (is_pid start-val-pid) 'true)
    (is-equal stop-again-val 'ok)))
</pre>
</div>

<p>
Now lets run the test.
</p>

<div class="org-src-container">
<pre class="src src-sh">module: pseudobank-tests
  account_server_starts ............................................. [ok]
  account_server_starts_with_zero_balance ........................... [ok]
  account_server_deposit_works ...................................... [ok]
  account_server_withdrawal_works ................................... [ok]
  account_server_starts_and_stops ................................... [ok]
</pre>
</div>

<p>
Giddy up, now we have the server restarting, but back to the topic at hand getting
withdraw and its rules
</p>
</div>
</div>
<div id="outline-container-org59d0901" class="outline-3">
<h3 id="org59d0901">Withdraw resumed:</h3>
<div class="outline-text-3" id="text-org59d0901">
<p>
Lets get back to withdraw, to fix it.. the next thing we need to implement is ensure that
you cant withdraw can not put it the account balance into negative value. Here's the test.
</p>

<div class="org-src-container">
<pre class="src src-lisp">(deftest account-server-withdraw-negative-test
  (account:start)
    (<span style="font-weight: bold;">let*</span> ((starting-balance (account:get-balance))
          (deposit-amount 1.00)
          (withdraw-amount 200.00))
      (account:deposit deposit-amount)
      (is (=:= (account:withdraw withdraw-amount) 'insufficient-funds))))
</pre>
</div>

<p>
This test will fail when we run the test because there has been no error condition
returning 'insufficient-funds when the withdraw amount exceeds available balance.
</p>

<p>
Fixing that now, we're modifying <code>handle_call</code> to include a conditional return based
on if the amount is greater than the balance.
</p>

<div class="org-src-container">
<pre class="src src-lisp"><span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">withdraw
</span>(((tuple 'withdraw amount) _caller state)

 <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">first step, check that amount is less than the current balance.
</span> (<span style="font-weight: bold;">if</span> (&gt; amount (map-get state 'balance))
   <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">true condition
</span>   `#(reply ,'insufficient-funds ,state)
   <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">false condition
</span>   `#(reply ,'ok ,(map-update state 'balance (- (map-get state 'balance) amount)))))
</pre>
</div>

<p>
All tests should now pass.
</p>

<div class="org-src-container">
<pre class="src src-sh">$ rebar3 as test lfe ltest
===&gt; Verifying dependencies...
===&gt; Compiling pseudobank
================================ <span style="font-weight: bold; font-style: italic;">ltest</span> =================================

------------------------------ Unit Tests ------------------------------

module: pseudobank-tests
  account_server_starts ............................................. [ok]
  account_server_starts_with_zero_balance ........................... [ok]
  account_server_deposit_works ...................................... [ok]
  account_server_withdrawal_works ................................... [ok]
  account_server_starts_and_stops ................................... [ok]
  account_server_withdraw_negative_test ............................. [ok]
  <span style="font-weight: bold;">time</span>: 25ms

summary:
  Tests: 6  Passed: 6  Skipped: 0  Failed: 0 Erred: 0
  Total time: 43ms
</pre>
</div>

<p>
This isnt an exhaustive test suite, but its the basics of the gen_server and
test driven development for lfe.  I'll upload the project to github and put a
link right here soon.
</p>
</div>
</div>
<div id="outline-container-orge969feb" class="outline-2">
<h2 id="orge969feb">Resources:</h2>
<div class="outline-text-2" id="text-orge969feb">
<ul class="org-ul">
<li><a href="https://www.erlang.org/doc/man/gen_server.html#Module:handle_call-3">https://www.erlang.org/doc/man/gen_server.html#Module:handle_call-3</a></li>
<li><a href="https://www.erlang-factory.com/upload/presentations/523/EFSF2012-Implementinglanguages.pdf">https://www.erlang-factory.com/upload/presentations/523/EFSF2012-Implementinglanguages.pdf</a></li>
<li><a href="https://github.com/lfex/ltest">https://github.com/lfex/ltest</a></li>
</ul>
</div>
</div>
</div>
</body>
</html>
